torbrodtkorb/alva-master/firmware/pack/edc/AVR128DB48.PIC
        <edc:SFRDef ltx:memberofperipheral="TCB3" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="-------r" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xB37">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="RUN" edc:nzwidth="0x1" edc:desc="Run"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCB3" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0xB38">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCB3">
              <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Run"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCB3" edc:cname="TEMP" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:_addr="0xB39"/>
        <edc:SFRDef ltx:memberofperipheral="TCB3" edc:cname="CNT" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:_addr="0xB3A"/>
        <edc:SFRDef ltx:memberofperipheral="TCB3" edc:cname="CCMP" edc:nzwidth="0x10" edc:access="nnnnnnnnnnnnnnnn" edc:_addr="0xB3C"/>
        <edc:AdjustPoint edc:offset="0x42" edc:_addr="0xB3E"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="-nnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x7F" edc:_addr="0xB80">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
              <edc:SFRFieldDef edc:cname="SYNCPRES" edc:nzwidth="0x2" edc:desc="Synchronization prescaler">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Selected clock source divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Selected clock source divided by 2" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Selected clock source divided by 4" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Selected clock source divided by 8" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CNTPRES" edc:nzwidth="0x2" edc:desc="Counter prescaler">
                <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Sync clock divided by 1" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Sync clock divided by 4" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Sync clock divided by 32" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:nzwidth="0x2" edc:desc="Clock select">
                <edc:SFRFieldSemantic edc:cname="OSCHF" edc:desc="Internal High-Frequency oscillator" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PLL" edc:desc="PLL" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="EXTCLK" edc:desc="External Clock" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="CLKPER" edc:desc="Peripheral clock" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0xB81">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="WGMODE" edc:nzwidth="0x2" edc:desc="Waveform generation mode">
                <edc:SFRFieldSemantic edc:cname="ONERAMP" edc:desc="One ramp mode" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="TWORAMP" edc:desc="Two ramp mode" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="FOURRAMP" edc:desc="Four ramp mode" edc:when="(field &amp; 0x3) == 0x02"/>
                <edc:SFRFieldSemantic edc:cname="DS" edc:desc="Dual slope mode" edc:when="(field &amp; 0x3) == 0x03"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CTRLC" edc:nzwidth="0x8" edc:access="nn--n-nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0xCB" edc:_addr="0xB82">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="CMPOVR" edc:nzwidth="0x1" edc:desc="Compare output value override"/>
              <edc:SFRFieldDef edc:cname="AUPDATE" edc:nzwidth="0x1" edc:desc="Auto update"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FIFTY" edc:nzwidth="0x1" edc:desc="Fifty percent waveform"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="CMPCSEL" edc:nzwidth="0x1" edc:desc="Compare C output select">
                <edc:SFRFieldSemantic edc:cname="PWMA" edc:desc="PWM A output" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PWMB" edc:desc="PWM B output" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:SFRFieldDef edc:cname="CMPDSEL" edc:nzwidth="0x1" edc:desc="Compare D output select">
                <edc:SFRFieldSemantic edc:cname="PWMA" edc:desc="PWM A output" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="PWMB" edc:desc="PWM B output" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CTRLD" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0xB83">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="CMPAVAL" edc:nzwidth="0x4" edc:desc="Compare A value"/>
              <edc:SFRFieldDef edc:cname="CMPBVAL" edc:nzwidth="0x4" edc:desc="Compare B value"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="CTRLE" edc:nzwidth="0x8" edc:access="n--nnnnn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x9F" edc:_addr="0xB84">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="SYNCEOC" edc:nzwidth="0x1" edc:desc="Synchronize end of cycle strobe"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:nzwidth="0x1" edc:desc="synchronize strobe"/>
              <edc:SFRFieldDef edc:cname="RESTART" edc:nzwidth="0x1" edc:desc="Restart strobe"/>
              <edc:SFRFieldDef edc:cname="SCAPTUREA" edc:nzwidth="0x1" edc:desc="Software Capture A Strobe"/>
              <edc:SFRFieldDef edc:cname="SCAPTUREB" edc:nzwidth="0x1" edc:desc="Software Capture B Strobe"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="DISEOC" edc:nzwidth="0x1" edc:desc="Disable at end of cycle"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x3" edc:_addr="0xB85"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="EVCTRLA" edc:nzwidth="0x8" edc:access="nn-n-n-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:_addr="0xB88">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="TRIGEI" edc:nzwidth="0x1" edc:desc="Trigger event enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x1" edc:desc="Event action">
                <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Event trigger a fault" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Event trigger a fault and capture" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EDGE" edc:nzwidth="0x1" edc:desc="Edge select">
                <edc:SFRFieldSemantic edc:cname="FALL_LOW" edc:desc="The falling edge or low level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RISE_HIGH" edc:desc="The rising edge or high level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CFG" edc:nzwidth="0x2" edc:desc="Event config">
                <edc:SFRFieldSemantic edc:cname="NEITHER" edc:desc="Neither Filter nor Asynchronous Event is enabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Input Capture Noise Cancellation Filter enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Asynchronous Event output qualification enabled" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="EVCTRLB" edc:nzwidth="0x8" edc:access="nn-n-n-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD5" edc:_addr="0xB89">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="TRIGEI" edc:nzwidth="0x1" edc:desc="Trigger event enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTION" edc:nzwidth="0x1" edc:desc="Event action">
                <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Event trigger a fault" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="CAPTURE" edc:desc="Event trigger a fault and capture" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EDGE" edc:nzwidth="0x1" edc:desc="Edge select">
                <edc:SFRFieldSemantic edc:cname="FALL_LOW" edc:desc="The falling edge or low level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="RISE_HIGH" edc:desc="The rising edge or high level of event generates retrigger or fault action" edc:when="(field &amp; 0x1) == 0x01"/>
              </edc:SFRFieldDef>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CFG" edc:nzwidth="0x2" edc:desc="Event config">
                <edc:SFRFieldSemantic edc:cname="NEITHER" edc:desc="Neither Filter nor Asynchronous Event is enabled" edc:when="(field &amp; 0x3) == 0x00"/>
                <edc:SFRFieldSemantic edc:cname="FILTER" edc:desc="Input Capture Noise Cancellation Filter enabled" edc:when="(field &amp; 0x3) == 0x01"/>
                <edc:SFRFieldSemantic edc:cname="ASYNC" edc:desc="Asynchronous Event output qualification enabled" edc:when="(field &amp; 0x3) == 0x02"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xB8A"/>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="INTCTRL" edc:nzwidth="0x8" edc:access="----nn-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD" edc:_addr="0xB8C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow interrupt enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TRIGA" edc:nzwidth="0x1" edc:desc="Trigger A interrupt enable"/>
              <edc:SFRFieldDef edc:cname="TRIGB" edc:nzwidth="0x1" edc:desc="Trigger B interrupt enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef ltx:memberofperipheral="TCD0" edc:cname="INTFLAGS" edc:nzwidth="0x8" edc:access="----nn-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0xD" edc:_addr="0xB8D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCD0">
              <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow interrupt enable"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TRIGA" edc:nzwidth="0x1" edc:desc="Trigger A interrupt enable"/>
              <edc:SFRFieldDef edc:cname="TRIGB" edc:nzwidth="0x1" edc:desc="Trigger B interrupt enable"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
